SunCity/src/Catalogs/ВидыОплатЧекаККМ/ВидыОплатЧекаККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОплатЧекаККМ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БанковскийПлатеж</name>
      <description>Банковский платеж</description>
    </items>
    <items>
      <name>ВстречноеПредоставление</name>
      <description>Встречное предоставление</description>
    </items>
    <items>
      <name>ЗачетАванса</name>
      <description>Зачет аванса</description>
    </items>
    <items>
      <name>МобильныйПлатеж</name>
      <description>Мобильный платеж</description>
    </items>
    <items>
      <name>Наличные</name>
      <description>Наличные</description>
    </items>
    <items>
      <name>ОплатаБонусамиКакСкидкой</name>
      <description>Оплата бонусами (распределяется как скидка)</description>
    </items>
    <items>
      <name>ОплатаВрассрочку</name>
      <description>Оплата в рассрочку</description>
    </items>
    <items>
      <name>ОплатаПодарочнымСертификатом</name>
      <description>Оплата подарочным сертификатом</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипыОплатЧекаККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>БанкКредитор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентБанковскойКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатежнаяСистема</name>
    <type>
      <types>EnumRef.ТипыПлатежнойСистемыККТ</types>
    </type>
  </attributes>
</mdclass:Catalog>

SunCity/src/Enums/ТипыОплатЧекаККМ/ТипыОплатЧекаККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОплатЧекаККМ</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяКарта</name>
  </enumValues>
  <enumValues>
    <name>БанковскийКредит</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>Бонусы</name>
  </enumValues>
  <enumValues>
    <name>ЗачетАванса</name>
  </enumValues>
  <enumValues>
    <name>ВРассрочку</name>
  </enumValues>
  <enumValues>
    <name>МобильныйПлатеж</name>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяСистема</name>
  </enumValues>
  <enumValues>
    <name>БанковскийПлатеж</name>
  </enumValues>
  <enumValues>
    <name>ВстречноеПредоставление</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Catalogs/ВидыОплатЧекаККМ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура заполняет предопределенные элементы статей движения денежных средств.
//
Процедура ЗаполнитьПредопределенные() Экспорт
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Справочники.ВидыОплатЧекаККМ.Наличные,
		Перечисления.ТипыОплатЧекаККМ.Наличные);
	Соответствие.Вставить(Справочники.ВидыОплатЧекаККМ.ОплатаБонусамиКакСкидкой,
		Перечисления.ТипыОплатЧекаККМ.Бонусы);
	Соответствие.Вставить(Справочники.ВидыОплатЧекаККМ.ОплатаПодарочнымСертификатом,
		Перечисления.ТипыОплатЧекаККМ.ПодарочныйСертификат);
	Соответствие.Вставить(Справочники.ВидыОплатЧекаККМ.ОплатаВРассрочку,
		Перечисления.ТипыОплатЧекаККМ.ВРассрочку);
	Соответствие.Вставить(Справочники.ВидыОплатЧекаККМ.ЗачетАванса,
		Перечисления.ТипыОплатЧекаККМ.ЗачетАванса);
	Соответствие.Вставить(Справочники.ВидыОплатЧекаККМ.БанковскийПлатеж,
		Перечисления.ТипыОплатЧекаККМ.БанковскийПлатеж);
	Соответствие.Вставить(Справочники.ВидыОплатЧекаККМ.ВстречноеПредоставление,
		Перечисления.ТипыОплатЧекаККМ.ВстречноеПредоставление);
	Соответствие.Вставить(Справочники.ВидыОплатЧекаККМ.МобильныйПлатеж,
		Перечисления.ТипыОплатЧекаККМ.МобильныйПлатеж);
		
	Для Каждого Элемент Из Соответствие Цикл
	
		СправочникОбъект = Элемент.Ключ.ПолучитьОбъект();
		Если НЕ СправочникОбъект.ТипОплаты = Элемент.Значение Тогда
			СправочникОбъект.ТипОплаты = Элемент.Значение;
			Попытка
				СправочникОбъект.УстановитьНовыйКод();
				СправочникОбъект.Записать();
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Заполнение предопределенных'"),
				УровеньЖурналаРегистрации.Ошибка,,,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает список реквизитов, которые не нужно редактировать
// с помощью обработки группового изменения объектов.
//
// Возвращаемое значение:
//  Массив - массив нередактируемых реквизитов.
//
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	НеРедактируемыеРеквизиты = Новый Массив;
	
	НеРедактируемыеРеквизиты.Добавить("ТипОплаты");
	
	Возврат НеРедактируемыеРеквизиты;
	
КонецФункции

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
